OdGsDCPoint.op_Subscript(System.UInt32)
\remarks
Returns i-th coordinate of this point.
\param i [in]  i-th coordinate of this point where 0 is x coordinate and 1 is y coordinate.

OdGsDCPoint.op_Inequality(OdGsDCPoint!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Inequality operator for the OdGsDCPoint class.
Points are considered not equal if at least one of the following conditions fails:
* the x coordinate of this point equals to the x coordinate of the passed point
* the y coordinate of this point equals to the y coordinate of the passed point
\param dcPoint [in]  2D point in device coordinates to compare.

OdGsDCPoint.op_Equality(OdGsDCPoint!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Assignment operator for the OdGsDCPoint class.
\param dcPoint [in]  2D point in device coordinates to assign.
\remarks
Equality operator for the OdGsDCPoint class.
Points are considered equal if:
* the x coordinate of this point equals to the x coordinate of the passed point
* the y coordinate of this point equals to the y coordinate of the passed point
\param dcPoint [in]  2D point in device coordinates to compare.

OdGsDCPoint.op_Assign(OdGsDCPoint.MinFlag)
\remarks
Assignment operator for the OdGsDCPoint class. Assigns the minimum allowed values for x and y coordinates for this object.
\param MinFlag [in]  Sets minimum allowed values for x and y axes.

OdGsDCPoint.op_Assign(OdGsDCPoint.MaxFlag)
\remarks
Assignment operator for the OdGsDCPoint class. Assigns the maximum allowed values for x and y coordinates for this object.
\param MaxFlag [in]  Sets maximum allowed values for x and y axes.

OdGsDCPoint.#ctor(OdGsDCPoint.MinFlag)
\details
Constructor for the OdGsDCPoint class. Builds an instance of the object with the following parameters:
OdGsDCPoint(Minimum) sets x = SCALAR_MIN, y = SCALAR_MIN
\param MinFlag [in]  Sets minimum allowed values for x and y axes.

OdGsDCPoint.#ctor(OdGsDCPoint.MaxFlag)
\details
Constructor for the OdGsDCPoint class. Builds an instance of the object with the following parameters:
OdGsDCPoint(Maximum) sets x = SCALAR_MAX, y = SCALAR_MAX
\param MaxFlag [in]  Sets maximum allowed values for x and y axes.

OdGsDCPoint.#ctor(System.Int32!System.Runtime.CompilerServices.IsLong,System.Int32!System.Runtime.CompilerServices.IsLong)
\details
Constructor for the OdGsDCPoint class.
\param xx [in]  The X-coordinate of this point.
\param yy [in]  The Y-coordinate of this point.

OdGsDCPoint.#ctor
\details
Default constructor for the OdGsDCPoint class. Creates an instance with 0 for x and y coordinates.